class CharacterStudio():
    """ 
    Создание персонажей.

    Attributes:
        заготовки_персонажей (list): Список заготовок персонажей.
    """

    def __init__(self):
        """ 
        Инициализация класса студии персонажей.
        """
        self.заготовки_персонажей = []

    def загрузка_персонажа(self):
        """ 
        Загрузка персонажа.
        """
        pass

    def обозначить_скелет_для_движения(self):
        """ 
        Обозначить скелет для движения.
        """
        pass
