class ModelsViewing:
    """
    Просмотр моделей.

    Методы:
        просмотр_модели_без_загрузки(): Позволяет просматривать модель без загрузки.
        поворот_модели(): Позволяет поворачивать модель для просмотра.
    """

    def просмотр_модели_без_загрузки(self):
        """
        Просмотр модели без загрузки.

        Этот метод позволяет просматривать модель без необходимости ее загрузки в память.
        """
        pass

    def поворот_модели(self):
        """
        Поворот модели.

        Этот метод позволяет пользователю поворачивать модель для просмотра в трехмерном пространстве.
        """
        pass
