class MultipleCharactersInScene():
    """
    Инструмент для создания множественных персонажей в сцене.

    Attributes:
        максимальное_количество_персонажей (int): Максимальное количество персонажей, которые можно создать в сцене.
    """

    def __init__(self):
        """
        Инициализация класса для создания множественных персонажей в сцене.
        """
        self.максимальное_количество_персонажей = 3

    def дублирование_персонажей(self):
        """
        Дублирование персонажей.

        Этот метод позволяет дублировать персонажей в сцене.
        """
        pass
